/* Montura Sede Monk */



/* 

-[¿Qué Maestro?]46353

-[El cuento de Ban-Lu]46341

-[Regreso a la Cima Quebrada]46342

-[El rastro de Ban-Lu]46343

-[Grisgrís de Maloliente]46344

-[La sombra de Ban-Lu]46346

-[Limpieza en el pasillo Sha]46347

-[El río a Ban-Lu]46348

-[Lirios para Ryuli]46349

-[La prueba de Ban-Lu] 46350

*/

/* Quest Obje */


DELETE FROM `quest_objectives` WHERE (`ID`='289722');
DELETE FROM `quest_objectives` WHERE (`ID`='289723');
DELETE FROM `quest_objectives` WHERE (`ID`='289796');
DELETE FROM `quest_objectives` WHERE (`ID`='289797');
INSERT INTO `quest_objectives` (`ID`, `QuestID`, `Type`, `StorageIndex`, `ObjectID`, `Amount`, `Flags`, `Flags2`, `TaskStep`, `Description`, `VerifiedBuild`) VALUES
('289722', '46343', '0', '0', '120772', '1', '0', '0', '0', NULL, '24367'),
('289723', '46343', '0', '1', '120773', '1', '2', '0', '0', NULL, '24367'),
('289796', '46343', '0', '2', '120774', '1', '2', '0', '0', NULL, '24367'),
('289797', '46343', '0', '3', '120775', '1', '2', '0', '0', NULL, '24367');


DELETE FROM `quest_objectives` WHERE (`ID`='289721');
INSERT INTO `quest_objectives` (`ID`, `QuestID`, `Type`, `StorageIndex`, `ObjectID`, `Amount`, `Flags`, `Flags2`, `TaskStep`, `Description`, `VerifiedBuild`) VALUES
('289721', '46341', '0', '0', '120758', '1', '0', '0', '0', NULL, '24367');

/* conditions */

DELETE FROM `conditions` WHERE (`SourceTypeOrReferenceId`='15') AND (`SourceGroup`='20992') AND (`SourceEntry`='0') AND (`SourceId`='0') AND (`ElseGroup`='0') AND (`ConditionTypeOrReference`='41') AND (`ConditionTarget`='0') AND (`ConditionValue1`='46347') AND (`ConditionValue2`='120747') AND (`ConditionValue3`='0');
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `SourceId`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `ConditionValue3`, `NegativeCondition`, `ErrorTextId`, `ScriptName`, `Comment`) VALUES
 ('15', '20992', '0', '0', '0', '41', '0', '46347', '120747', '0', '0', '0', '', 'Ver Gossip Solo con la quest');

/* UPdate */

UPDATE `creature_template` SET 
`gossip_menu_id`='20992' 
WHERE (`entry`='120747');

/* Phase 819 */

DELETE FROM `gameobject` WHERE (`id`='268813');
INSERT INTO `gameobject` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `phaseMask`, `PhaseId`, `position_x`, `position_y`, `position_z`, `orientation`, `rotation0`, `rotation1`, `rotation2`, `rotation3`, `spawntimesecs`, `animprogress`, `AiID`, `state`, `isActive`, `personal_size`) VALUES
('25179253', '268813', '870', '5841', '6557', '1', '1', '819', '4057.64', '288.257', '188.433', '0', '0', '0', '0', '1', '180', '255', '0', '1', '0', '0'),
('25179252', '268813', '870', '5841', '6557', '1', '1', '819', '4051.04', '256.879', '188.433', '0', '0', '0', '0', '1', '180', '255', '0', '1', '0', '0'),
('25179251', '268813', '870', '5841', '6557', '1', '1', '819', '4012.25', '262.062', '188.433', '0', '0', '0', '0', '1', '180', '255', '0', '1', '0', '0'),
('25179250', '268813', '870', '5841', '6552', '1', '1', '819', '3995.52', '288.04', '188.433', '0', '0', '0', '0', '1', '180', '255', '0', '1', '0', '0'),
('25179249', '268813', '870', '5841', '6552', '1', '1', '819', '3777.81', '271.337', '390.271', '0', '0', '0', '0', '1', '180', '255', '0', '1', '0', '0'),
('25179248', '268813', '870', '5841', '6552', '1', '1', '819', '3822.79', '296.439', '390.271', '0', '0', '0', '0', '1', '180', '255', '0', '1', '0', '0'),
('25179247', '268813', '870', '5841', '6552', '1', '1', '819', '3716.51', '239.05', '390.271', '0', '0', '0', '0', '1', '180', '255', '0', '1', '0', '0'),
('25179246', '268813', '870', '5841', '6552', '1', '1', '819', '3744.5', '273.745', '390.271', '0', '0', '0', '0', '1', '180', '255', '0', '1', '0', '0');

/* Text y BroadcastText */

DELETE FROM `creature_text` WHERE (`Entry`='120814');
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `MinTimer`, `MaxTimer`, `SpellID`, `comment`) VALUES
('120814', '4', '0', 'В тебе сочетаются мудрость, стойкость и чистота, приличествующие великому мастеру. Осталось проверить лишь твои боевые навыки!', '12', '0', '100', '603', '0', '82426', '128501', '0', '0', '0', 'Event-ooc'),
('120814', '0', '0', 'Великий мастер! Бань Лу нашелся?', '12', '0', '100', '6', '0', '82402', '128496', '0', '0', '0', 'Range-link'),
('120814', '2', '0', 'И однажды мне явилось видение... нечто новое и интересное... ты!', '12', '0', '100', '5', '0', '82424', '128499', '0', '0', '0', 'R - L 2'),
('120814', '3', '0', 'Многие увидели твои добродетели. Мастер Бу – терпение, груммели – честь; Шадо-Пан – долг, цзинь-юй – веру.', '12', '0', '100', '1', '0', '82425', '128500', '0', '0', '0', 'Saltar'),
('120814', '1', '0', 'Смерть Хайта огорчила меня. С камнем на сердце я скитался по Пандарии.', '12', '0', '100', '274', '0', '82423', '128498', '0', '0', '0', 'Reto - jugador'),
('120814', '5', '0', 'Твои навыки впечатляют, великий мастер. Для меня будет честью служить тебе, как я служил твоим предшественникам – лидерам нашего ордена.', '14', '0', '100', '377', '0', '82427', '128502', '0', '0', '0', 'Derrotado');


/* loot */

DELETE FROM `gameobject_loot_template` WHERE (`entry`='268813') AND (`item`='147313');
INSERT INTO `gameobject_loot_template` (`entry`, `item`, `ChanceOrQuestChance`, `lootmode`, `groupid`, `mincountOrRef`, `maxcount`) VALUES 
('268813', '147313', '100', '1', '0', '1', '1');

/* SmartAI */

DELETE FROM `smart_scripts` WHERE (`entryorguid`='120747');
DELETE FROM `smart_scripts` WHERE (`entryorguid`='120722');
DELETE FROM `smart_scripts` WHERE (`entryorguid`='120726');
DELETE FROM `smart_scripts` WHERE (`entryorguid`='12072600');

INSERT INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`, `event_param1`, `event_param2`, `event_param3`, `event_param4`, `action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`, `target_type`, `target_param1`, `target_param2`, `target_param3`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
('120722', '0', '0', '0', '10', '0', '100', '0', '1', '10', '0', '0', '1', '0', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'smart_say'),
('120722', '0', '1', '0', '19', '0', '100', '0', '46343', '0', '0', '0', '206', '4907', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'smart_say'),
('120722', '0', '2', '0', '20', '0', '100', '0', '46343', '0', '0', '0', '206', '4908', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'smart_say'),
('120722', '0', '3', '0', '20', '0', '100', '0', '46347', '0', '0', '0', '1', '1', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'smart_say'),
('120747', '0', '0', '1', '62', '0', '100', '0', '20992', '1', '0', '0', '85', '240602', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'SmartCastSpell_on_Player'),
('120747', '0', '1', '0', '61', '0', '100', '0', '0', '0', '0', '0', '33', '120747', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'SmartCastSpell_on_Player'),
('120747', '0', '2', '3', '62', '0', '100', '0', '20992', '0', '0', '0', '33', '120747', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'SmartCastSpell_on_Player'),
('120747', '0', '3', '0', '61', '0', '100', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'SmartCastSpell_on_Player'),
('120726', '0', '0', '0', '19', '0', '100', '0', '46350', '0', '0', '0', '12', '120726', '3', '350000', '0', '0', '1', '7', '0', '0', '0', '0', '0', '0', '0', 'summon_to_plaer'),
('120726', '0', '1', '0', '54', '0', '100', '0', '0', '0', '0', '0', '80', '12072600', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_actions'),
('12072600', '9', '0', '0', '0', '0', '100', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_say'),
('12072600', '9', '1', '0', '0', '0', '100', '0', '0', '0', '0', '0', '53', '0', '120726', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_wp'),
('12072600', '9', '2', '0', '0', '0', '100', '0', '33000', '33000', '0', '0', '1', '1', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_say'),
('12072600', '9', '3', '0', '0', '0', '100', '0', '5000', '5000', '0', '0', '1', '2', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_say');

/* SmartAI Evento Ban- lu */

DELETE FROM `smart_scripts` WHERE (`entryorguid`='120814');
DELETE FROM `smart_scripts` WHERE (`entryorguid`='12081400');
INSERT INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`, `event_param1`, `event_param2`, `event_param3`, `event_param4`, `action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`, `target_type`, `target_param1`, `target_param2`, `target_param3`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
('120814', '0', '0', '0', '10', '0', '100', '0', '1', '15', '0', '0', '80', '12081400', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_actions'),
('120814', '0', '1', '2', '2', '0', '100', '0', '0', '10', '0', '0', '33', '120814', '0', '0', '0', '0', '0', '18', '50', '0', '0', '0', '0', '0', '0', 'smart_killcredit_on_player'),
('120814', '0', '2', '3', '61', '0', '100', '0', '0', '0', '0', '0', '2', '35', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_add factions'),
('120814', '0', '3', '4', '61', '0', '100', '0', '0', '0', '0', '0', '1', '5', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_npc_say_on_player'),
('120814', '0', '4', '0', '61', '0', '100', '0', '0', '0', '0', '0', '41', '5000', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_npc_say_on_player'),
('120814', '0', '5', '0', '0', '0', '100', '0', '7000', '8000', '14000', '16000', '11', '241748', '0', '0', '0', '0', '0', '2', '0', '0', '0', '0', '0', '0', '0', 'smart_npc_castspell_on_player'),
('120814', '0', '6', '0', '0', '0', '100', '0', '15000', '16000', '30000', '32000', '11', '241771', '0', '0', '0', '0', '0', '2', '0', '0', '0', '0', '0', '0', '0', 'smart_npc_castspell_on_player'),
('120814', '0', '7', '0', '0', '0', '100', '0', '20000', '21000', '40000', '42000', '11', '241790', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'smart_npc_castspell_on_player'),
('12081400', '9', '0', '0', '0', '0', '100', '0', '0', '0', '0', '0', '66', '0', '0', '0', '0', '0', '0', '18', '15', '0', '0', '0', '0', '0', '0', 'FC-C Evento'),
('12081400', '9', '1', '0', '0', '0', '100', '0', '0', '0', '0', '0', '33', '120847', '0', '0', '0', '0', '0', '18', '50', '0', '0', '0', '0', '0', '0', 'FC-E1'),
('12081400', '9', '2', '0', '0', '0', '100', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '7', '0', '0', '0', '0', '0', '0', '0', 'FC-Text'),
('12081400', '9', '3', '0', '0', '0', '100', '0', '8000', '8000', '0', '0', '11', '240783', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'FC-Complet'),
('12081400', '9', '4', '0', '0', '0', '100', '0', '5000', '5000', '0', '0', '1', '1', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'FC-C'),
('12081400', '9', '5', '0', '0', '0', '100', '0', '10000', '10000', '0', '0', '1', '2', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'FC-KillCred'),
('12081400', '9', '6', '0', '0', '0', '100', '0', '10000', '10000', '0', '0', '1', '3', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'FC-Text2'),
('12081400', '9', '7', '0', '0', '0', '100', '0', '14000', '14000', '0', '0', '1', '4', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'FC-textC'),
('12081400', '9', '8', '0', '0', '0', '100', '0', '10000', '10000', '0', '0', '2', '14', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'FC-Salto'),
('12081400', '9', '9', '0', '0', '0', '100', '0', '0', '0', '0', '0', '42', '1', '0', '0', '0', '0', '0', '1', '0', '0', '0', '0', '0', '0', '0', 'FC-Wp'),
('12081400', '9', '10', '0', '0', '0', '100', '0', '2000', '2000', '0', '0', '49', '0', '0', '0', '0', '0', '0', '18', '15', '0', '0', '0', '0', '0', '0', 'Start-Combat');
